// BSLLS:MissingVariablesDescription-off

Перем ФормаСправки;
Перем Диалоги;
Перем УправляемыйИнтерфейс;

Процедура ОткрытьФорму() Экспорт

	УправляемыйИнтерфейс = Новый УправляемыйИнтерфейс();
	
	ФормаСправки = УправляемыйИнтерфейс.СоздатьФорму();
	Диалоги = УправляемыйИнтерфейс.СтандартныеДиалоги;

	ФормаСправки.Заголовок = "Помощь по функционалу программы";
	ФормаСправки.УстановитьДействие(ЭтотОбъект, "ПриОткрытии", "ПриОткрытииФормы");

	ФормаСправки.Показать();

КонецПроцедуры

Процедура ПриОткрытииФормы() Экспорт

	грФорма = ФормаСправки.Элементы.Добавить("грФорма", "ОбычнаяГруппа", Неопределено);
	
	грФормаЛево = ФормаСправки.Элементы.Добавить("грФормаЛево", "ОбычнаяГруппа", грФорма);
	// грФормаЛево.Родитель = грФорма;

	грФормаПраво = ФормаСправки.Элементы.Добавить("грФормаПраво", "ОбычнаяГруппа", грФорма);
	// грФормаПраво.Родитель = грФорма;
	
	Декорация1 = ФормаСправки.Элементы.Добавить("Декорация1", "ПолеФормы", грФормаЛево);
	Декорация1.Вид = ФормаСправки.ВидПоляФормы.ПолеНадписи;
	Декорация1.Заголовок = "Привет, мир1!";
	// Декорация1.Родитель = грФормаЛево;
	
	Декорация2 = ФормаСправки.Элементы.Добавить("Декорация2", "ПолеФормы", грФормаПраво);
	Декорация2.Вид = ФормаСправки.ВидПоляФормы.ПолеНадписи;
	Декорация2.Заголовок = "Привет, мир2!";
	// Декорация2.Родитель = грФормаПраво;
	
КонецПроцедуры

&Желудь
&Прозвище("Форма")
Процедура ПриСозданииОбъекта()
КонецПроцедуры